Revit 2027 API
RebarWorkInstructions Enumeration
 Describes how a Free Form Rebar will be fabricated.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarWorkInstructions
Public Enumeration RebarWorkInstructions
public enum class RebarWorkInstructions
type RebarWorkInstructions
Members
Member name | Value | Description
Bent | 0 |  The bar will be bent in the shop. It will be matched to an existing Rebar Shape. If it can't be matched to an existing one a matching one will be created if it is possible.
Straight | 1 |  The bar will be delivered as a straight bar to the site and the shape code is one of the straight Rebar Shapes loaded into the project (e.g. 00).
See Also
Reference
Autodesk.Revit.DB.Structure Namespace